TOKEN = '7447772265:AAGqp2V9s7YDepkAFgRlFD2ouHzVrjsuG3A'

questions = [
    {
        'question': '1/10: Какое Ваше любимое время года?',
        'answer': {
            'Зима': ['Тигр', 'Енот'],
            'Лето': ['Слон', 'Попугай'],
            'Осень': ['Жаба', 'Саламандра', 'Черепаха'],
            'Весна': ['Фламинго', 'Аист', 'Питон'],
        }
    },
    {
        'question': '2/10: Какой цвет вам больше всего нравится?',
        'answer': {
            'Черный': ['Черепаха', 'Енот', 'Саламандра'],
            'Оранжевый': ['Питон', 'Тигр', 'Жаба'],
            'Серый': ['Слон', 'Аист'],
            'Красный': ['Попугай', 'Фламинго']
        }
    },
    {
        'question': '3/10: Какое ваше любимое домашнее животное?',
        'answer': {
            'Кошка': ['Тигр', 'Саламандра'],
            'Собака': ['Питон', 'Енот'],
            'Птица': ['Аист', 'Фламинго', 'Попугай'],
            'Рыба': ['Черепаха', 'Питон', 'Жаба']
        }
    },
    {
        'question': '4/10: Какой Ваш любимый вид спорта?',
        'answer': {
            'Бег': ['Тигр', 'Фламинго'],
            'Плавание': ['Черепаха', 'Жаба', 'Питон'],
            'Велоспорт': ['Аист'],
            'Футбол': ['Енот', 'Саламандра', 'Попугай']
        }
    },
    {
        'question': '5/10: Какое качество для вас наиболее важно в друзьях?',
        'answer': {
            'Сила и смеловсть': ['Тигр', 'Питон'],
            'Заботливость': ['Слон', 'Попугай'],
            'Открытость': ['Жаба', 'Черепаха', 'Фламинго'],
            'Умение адаптироваться': ['Саламандра', 'Аист', 'Енот']
        }
    },
    {
        'question': '6/10: Вашей отрицательной чертой является?',
        'answer': {
            'Зависть': ['Фламинго'],
            'Ложь': ['Жаба', 'Саламандра'],
            'Лень': ['Аист', 'Слон', 'Черепаха'],
            'Агрессивность': ['Енот', 'Тигр', 'Попугай']
        }
    },
    {
        'question': '7/10: Кто вы в этой жизни?',
        'answer': {
            'Оптимист': ['Аист', 'Фламинго'],
            'Бродяга': ['Слон', 'Попугай', 'Енот'],
            'Работяга': ['Тигр', 'Саламандра'],
            'Лидер': ['Черепаха', 'Жаба']
        }
    },
    {
        'question': '8/10: Что вы хотите от жизни?',
        'answer': {
            'Заработать много денег': ['Жаба', 'Питон'],
            'Приключения и свободу': ['Слон', 'Саламандра'],
            'Крепкую и дружную семью': ['Фламинго', 'Енот', 'Черепаха'],
            'Найти свое призвание': ['Тигр', 'Попугай', 'Аист'],
        }
    },
    {
        'question': '9/10: Что из этого вас больше всего привлекает?',
        'answer': {
            'Большая семья': ['Жаба'],
            'Саморазвитие': ['Слон'],
            'Новые знания': ['Питон'],
            'Общение с людьми': ['Черепаха'],
        }
    },
    {
        'question': '10/10: Чего вы больше всего боитесь?',
        'answer': {
            'Ошибиться': ['Аист'],
            'Одиночества': ['Попугай'],
            'Изменений': ['Саламандра'],
            'Любви': ['Енот']
        }
    },
]


review = []

result = {}

quiz_data = {}
